consumir_middleware_exemplos/benchmark/resultados_nao_usados/teste_500_write/consultas_consecutivas.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Target transaction rate: 5/sec
Report intermediate results every 2 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 2s ] thds: 8 tps: 3.50 qps: 20.98 (r/w/o: 0.00/13.99/6.99) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 2s ] queue length: 0, concurrency: 0
[ 4s ] thds: 8 tps: 5.00 qps: 30.00 (r/w/o: 0.00/20.00/10.00) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 4s ] queue length: 0, concurrency: 0
[ 6s ] thds: 8 tps: 4.00 qps: 24.00 (r/w/o: 0.00/16.00/8.00) lat (ms,95%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 6s ] queue length: 0, concurrency: 0
[ 8s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 8s ] queue length: 0, concurrency: 0
[ 10s ] thds: 8 tps: 7.00 qps: 42.00 (r/w/o: 0.00/28.00/14.00) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 10s ] queue length: 0, concurrency: 0
[ 12s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 12s ] queue length: 0, concurrency: 0
[ 14s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 14s ] queue length: 0, concurrency: 0
[ 16s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 16s ] queue length: 0, concurrency: 0
[ 18s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 18s ] queue length: 0, concurrency: 0
[ 20s ] thds: 8 tps: 2.50 qps: 15.00 (r/w/o: 0.00/10.00/5.00) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 20s ] queue length: 0, concurrency: 0
[ 22s ] thds: 8 tps: 3.00 qps: 18.00 (r/w/o: 0.00/12.00/6.00) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 22s ] queue length: 0, concurrency: 0
[ 24s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 24s ] queue length: 0, concurrency: 0
[ 26s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 57.87 err/s: 0.00 reconn/s: 0.00
[ 26s ] queue length: 0, concurrency: 0
[ 28s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 28s ] queue length: 0, concurrency: 0
[ 30s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 30s ] queue length: 0, concurrency: 0
[ 32s ] thds: 8 tps: 4.00 qps: 24.00 (r/w/o: 0.00/16.00/8.00) lat (ms,95%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 32s ] queue length: 0, concurrency: 0
[ 34s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 34s ] queue length: 0, concurrency: 0
[ 36s ] thds: 8 tps: 6.50 qps: 41.50 (r/w/o: 0.00/28.00/13.50) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 36s ] queue length: 0, concurrency: 1
[ 38s ] thds: 8 tps: 5.00 qps: 27.50 (r/w/o: 0.00/18.00/9.50) lat (ms,95%): 43.39 err/s: 0.00 reconn/s: 0.00
[ 38s ] queue length: 0, concurrency: 0
[ 40s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 40s ] queue length: 0, concurrency: 0
[ 42s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 42s ] queue length: 0, concurrency: 0
[ 44s ] thds: 8 tps: 5.50 qps: 34.00 (r/w/o: 0.00/22.50/11.50) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 44s ] queue length: 0, concurrency: 1
[ 46s ] thds: 8 tps: 3.00 qps: 17.00 (r/w/o: 0.00/11.50/5.50) lat (ms,95%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 46s ] queue length: 0, concurrency: 0
[ 48s ] thds: 8 tps: 4.00 qps: 24.00 (r/w/o: 0.00/16.00/8.00) lat (ms,95%): 24.38 err/s: 0.00 reconn/s: 0.00
[ 48s ] queue length: 0, concurrency: 0
[ 50s ] thds: 8 tps: 3.00 qps: 18.00 (r/w/o: 0.00/12.00/6.00) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 50s ] queue length: 0, concurrency: 0
[ 52s ] thds: 8 tps: 5.00 qps: 32.50 (r/w/o: 0.00/22.00/10.50) lat (ms,95%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 52s ] queue length: 0, concurrency: 1
[ 54s ] thds: 8 tps: 4.50 qps: 24.50 (r/w/o: 0.00/16.00/8.50) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 54s ] queue length: 0, concurrency: 0
[ 56s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 56s ] queue length: 0, concurrency: 0
[ 58s ] thds: 8 tps: 3.00 qps: 20.50 (r/w/o: 0.00/14.00/6.50) lat (ms,95%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 58s ] queue length: 0, concurrency: 1
[ 60s ] thds: 8 tps: 9.00 qps: 51.50 (r/w/o: 0.00/34.00/17.50) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 60s ] queue length: 0, concurrency: 0
[ 62s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 62s ] queue length: 0, concurrency: 0
[ 64s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 64s ] queue length: 0, concurrency: 0
[ 66s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 66s ] queue length: 0, concurrency: 0
[ 68s ] thds: 8 tps: 8.50 qps: 53.50 (r/w/o: 0.00/36.00/17.50) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 68s ] queue length: 0, concurrency: 1
[ 70s ] thds: 8 tps: 4.50 qps: 24.50 (r/w/o: 0.00/16.00/8.50) lat (ms,95%): 231.53 err/s: 0.00 reconn/s: 0.00
[ 70s ] queue length: 0, concurrency: 0
[ 72s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 72s ] queue length: 0, concurrency: 0
[ 74s ] thds: 8 tps: 7.00 qps: 42.00 (r/w/o: 0.00/28.00/14.00) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 74s ] queue length: 0, concurrency: 0
[ 76s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 76s ] queue length: 0, concurrency: 0
[ 78s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 78s ] queue length: 0, concurrency: 0
[ 80s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 80s ] queue length: 0, concurrency: 0
[ 82s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 82s ] queue length: 0, concurrency: 0
[ 84s ] thds: 8 tps: 9.00 qps: 54.00 (r/w/o: 0.00/36.00/18.00) lat (ms,95%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 84s ] queue length: 0, concurrency: 0
[ 86s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 86s ] queue length: 0, concurrency: 0
[ 88s ] thds: 8 tps: 7.00 qps: 42.00 (r/w/o: 0.00/28.00/14.00) lat (ms,95%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 88s ] queue length: 0, concurrency: 0
[ 90s ] thds: 8 tps: 3.50 qps: 23.50 (r/w/o: 0.00/16.00/7.50) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 90s ] queue length: 0, concurrency: 1
[ 92s ] thds: 8 tps: 6.50 qps: 36.50 (r/w/o: 0.00/24.00/12.50) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 92s ] queue length: 0, concurrency: 0
[ 94s ] thds: 8 tps: 7.00 qps: 42.00 (r/w/o: 0.00/28.00/14.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 94s ] queue length: 0, concurrency: 0
[ 96s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 96s ] queue length: 0, concurrency: 0
[ 98s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 98s ] queue length: 0, concurrency: 0
[ 100s ] thds: 8 tps: 8.00 qps: 48.01 (r/w/o: 0.00/32.00/16.00) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 100s ] queue length: 0, concurrency: 0
[ 102s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 102s ] queue length: 0, concurrency: 0
[ 104s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 104s ] queue length: 0, concurrency: 0
[ 106s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 106s ] queue length: 0, concurrency: 0
[ 108s ] thds: 8 tps: 4.00 qps: 26.50 (r/w/o: 0.00/18.00/8.50) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 108s ] queue length: 0, concurrency: 1
[ 110s ] thds: 8 tps: 6.50 qps: 36.50 (r/w/o: 0.00/24.00/12.50) lat (ms,95%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 110s ] queue length: 0, concurrency: 0
[ 112s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 112s ] queue length: 0, concurrency: 0
[ 114s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 114s ] queue length: 0, concurrency: 0
[ 116s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 116s ] queue length: 0, concurrency: 0
[ 118s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 118s ] queue length: 0, concurrency: 0
[ 120s ] thds: 8 tps: 3.00 qps: 18.00 (r/w/o: 0.00/12.00/6.00) lat (ms,95%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 120s ] queue length: 0, concurrency: 0
[ 122s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 122s ] queue length: 0, concurrency: 0
[ 124s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 124s ] queue length: 0, concurrency: 0
[ 126s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 126s ] queue length: 0, concurrency: 0
[ 128s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 128s ] queue length: 0, concurrency: 0
[ 130s ] thds: 8 tps: 5.50 qps: 35.50 (r/w/o: 0.00/24.00/11.50) lat (ms,95%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 130s ] queue length: 0, concurrency: 1
[ 132s ] thds: 8 tps: 4.50 qps: 24.50 (r/w/o: 0.00/16.00/8.50) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 132s ] queue length: 0, concurrency: 0
[ 134s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 134s ] queue length: 0, concurrency: 0
[ 136s ] thds: 8 tps: 5.00 qps: 30.00 (r/w/o: 0.00/20.00/10.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 136s ] queue length: 0, concurrency: 0
[ 138s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 138s ] queue length: 0, concurrency: 0
[ 140s ] thds: 8 tps: 3.00 qps: 18.00 (r/w/o: 0.00/12.00/6.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 140s ] queue length: 0, concurrency: 0
[ 142s ] thds: 8 tps: 5.00 qps: 32.50 (r/w/o: 0.00/22.00/10.50) lat (ms,95%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 142s ] queue length: 0, concurrency: 1
[ 144s ] thds: 8 tps: 5.50 qps: 30.50 (r/w/o: 0.00/20.00/10.50) lat (ms,95%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 144s ] queue length: 0, concurrency: 0
[ 146s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 146s ] queue length: 0, concurrency: 0
[ 148s ] thds: 8 tps: 3.00 qps: 20.50 (r/w/o: 0.00/14.00/6.50) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 148s ] queue length: 0, concurrency: 1
[ 150s ] thds: 8 tps: 6.00 qps: 33.50 (r/w/o: 0.00/22.00/11.50) lat (ms,95%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 150s ] queue length: 0, concurrency: 0
[ 152s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 152s ] queue length: 0, concurrency: 0
[ 154s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 154s ] queue length: 0, concurrency: 0
[ 156s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 59.99 err/s: 0.00 reconn/s: 0.00
[ 156s ] queue length: 0, concurrency: 0
[ 158s ] thds: 8 tps: 6.50 qps: 39.00 (r/w/o: 0.00/26.00/13.00) lat (ms,95%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 158s ] queue length: 0, concurrency: 0
[ 160s ] thds: 8 tps: 4.00 qps: 24.00 (r/w/o: 0.00/16.00/8.00) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 160s ] queue length: 0, concurrency: 0
[ 162s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 162s ] queue length: 0, concurrency: 0
[ 164s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 164s ] queue length: 0, concurrency: 0
[ 166s ] thds: 8 tps: 10.00 qps: 62.50 (r/w/o: 0.00/42.00/20.50) lat (ms,95%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 166s ] queue length: 0, concurrency: 1
[ 168s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 168s ] queue length: 0, concurrency: 1
[ 170s ] thds: 8 tps: 6.50 qps: 36.50 (r/w/o: 0.00/24.00/12.50) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 170s ] queue length: 0, concurrency: 0
[ 172s ] thds: 8 tps: 1.00 qps: 8.50 (r/w/o: 0.00/6.00/2.50) lat (ms,95%): 28.67 err/s: 0.00 reconn/s: 0.00
[ 172s ] queue length: 0, concurrency: 1
[ 174s ] thds: 8 tps: 6.00 qps: 33.50 (r/w/o: 0.00/22.00/11.50) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 174s ] queue length: 0, concurrency: 0
[ 176s ] thds: 8 tps: 4.00 qps: 26.50 (r/w/o: 0.00/18.00/8.50) lat (ms,95%): 43.39 err/s: 0.00 reconn/s: 0.00
[ 176s ] queue length: 0, concurrency: 1
[ 178s ] thds: 8 tps: 5.00 qps: 27.50 (r/w/o: 0.00/18.00/9.50) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 178s ] queue length: 0, concurrency: 0
[ 180s ] thds: 8 tps: 4.00 qps: 24.00 (r/w/o: 0.00/16.00/8.00) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 180s ] queue length: 0, concurrency: 0
[ 182s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 182s ] queue length: 0, concurrency: 0
[ 184s ] thds: 8 tps: 6.00 qps: 36.00 (r/w/o: 0.00/24.00/12.00) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 184s ] queue length: 0, concurrency: 0
[ 186s ] thds: 8 tps: 4.50 qps: 27.00 (r/w/o: 0.00/18.00/9.00) lat (ms,95%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 186s ] queue length: 0, concurrency: 0
[ 188s ] thds: 8 tps: 2.50 qps: 15.00 (r/w/o: 0.00/10.00/5.00) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 188s ] queue length: 0, concurrency: 0
[ 190s ] thds: 8 tps: 3.00 qps: 18.00 (r/w/o: 0.00/12.00/6.00) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 190s ] queue length: 0, concurrency: 0
[ 192s ] thds: 8 tps: 3.50 qps: 21.00 (r/w/o: 0.00/14.00/7.00) lat (ms,95%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 192s ] queue length: 0, concurrency: 0
[ 194s ] thds: 8 tps: 5.50 qps: 33.00 (r/w/o: 0.00/22.00/11.00) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 194s ] queue length: 0, concurrency: 0
[ 196s ] thds: 8 tps: 6.50 qps: 39.00 (r/w/o: 0.00/26.00/13.00) lat (ms,95%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 196s ] queue length: 0, concurrency: 0
[ 198s ] thds: 8 tps: 4.00 qps: 26.50 (r/w/o: 0.00/18.00/8.50) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 198s ] queue length: 0, concurrency: 1
[ 200s ] thds: 8 tps: 4.00 qps: 21.50 (r/w/o: 0.00/14.00/7.50) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 200s ] queue length: 0, concurrency: 0
SQL statistics:
    queries performed:
        read:                            0
        write:                           4020
        other:                           2010
        total:                           6030
    transactions:                        1005   (5.01 per sec.)
    queries:                             6030   (30.09 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          200.4233s
    total number of events:              1005

Latency (ms):
         min:                                   20.92
         avg:                                   36.80
         max:                                  233.54
         95th percentile:                       84.47
         sum:                                36982.28

Threads fairness:
    events (avg/stddev):           125.6250/0.48
    execution time (avg/stddev):   4.6228/0.21